src/artillery/artilleryplaywright_local_ramp.yml
# Command for run: yarn start
config:
  target: https://dev.oneid.pagopa.it/login?response_type=CODE&scope=openid&client_id=bxMiPVktuZ5lBNbZYJ3ODosXL57ltrLp7BgyOkw-0v4&state=dev&nonce=11701879fd734d1486b8a6435025b465&redirect_uri=https://442zl6z6sbdqprefkazmp6dr3y0nmnby.lambda-url.eu-south-1.on.aws/client/cb
  phases:
    - duration: 60 # 1 minuto ramp up
      arrivalRate: 1
      rampTo: 1
      # maxVusers: 1
      name: Ramp up to 25 login/s
  engines:
    playwright:
      launchOptions:
        headless: false
      defaultTimeout: 10
  processor: "../artilleryplaywright.js"
scenarios:
  - engine: playwright
    flowFunction: "oi"