src/artillery/ramp_02.yml
# Steeper ramp than ramp_01, but still moderate for multi-task ECS execution
config:
  target: https://dev.oneid.pagopa.it/login?response_type=CODE&scope=openid&client_id={{ $processEnvironment.CLIENT_ID }}&state=dev&nonce=11701879fd734d1486b8a6435025b465&redirect_uri=https://442zl6z6sbdqprefkazmp6dr3y0nmnby.lambda-url.eu-south-1.on.aws/client/cb
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 2
      maxVusers: 8
      name: Ramp up to 2 login/s per task
    - duration: 60
      arrivalRate: 2
      rampTo: 3
      maxVusers: 12
      name: Ramp up to 3 login/s per task
    - duration: 60
      arrivalRate: 3
      rampTo: 4
      maxVusers: 16
      name: Ramp up to 4 login/s per task
    - duration: 60
      arrivalRate: 4
      rampTo: 5
      maxVusers: 20
      name: Ramp up to 5 login/s per task
    - duration: 60
      arrivalRate: 5
      rampTo: 6
      maxVusers: 24
      name: Ramp up to 6 login/s per task
    - duration: 60
      arrivalRate: 6
      rampTo: 7
      maxVusers: 28
      name: Ramp up to 7 login/s per task
    - duration: 60
      arrivalRate: 7
      rampTo: 8
      maxVusers: 32
      name: Ramp up to 8 login/s per task
    - duration: 60
      arrivalRate: 8
      rampTo: 9
      maxVusers: 36
      name: Ramp up to 9 login/s per task
    - duration: 60
      arrivalRate: 9
      maxVusers: 36
      name: Hold 9 login/s per task

  engines:
    playwright:
      launchOptions:
        headless: true
      defaultTimeout: 10
  processor: "../loginFlow.js"
scenarios:
  - engine: playwright
    flowFunction: "oi"